from content.advice import Advice, Paragraph, Video

testcase_before_refactor = Advice(
    id_="62d96bcf5a5819259704414f",
    title="สร้าง testcase ก่อน refactor ทุกครั้ง",
    title_url="สร้าง_testcase_ก่อน_refactor_ทุกครั้ง",
    short_description="testcase ไม่ได้มีประโยชน์แค่ในการทดสอบระบบเท่านั้น แต่เราสามารถสร้าง testcase เพื่อช่วย capture "
                      "พฤติกรรมของโค้ดเราในปัจจุบันเอาไว้ ซึ่งมีประโยชน์มากต่อการ refactor โค้ด",
    content=[
        Paragraph(
            "testcase ไม่ได้มีประโยชน์แค่ในการทดสอบระบบเท่านั้น แต่เราสามารถสร้าง testcase เพื่อช่วย capture "
            "พฤติกรรมของโค้ดเราในปัจจุบันเอาไว้ ซึ่งมีประโยชน์มากต่อการ refactor โค้ด"
        ),
        Paragraph(
            "เพราะการ refactor โค้ด มีจุดประสงค์เพื่อแก้ไขวิธีการเขียนเพื่อประโยชน์บางอย่าง เช่น "
            "ทำให้โค้ดอ่านง่ายขึ้น หรือทำให้โค้ดทำงานเร็วขึ้น เพราะฉะนั้นสิ่งสำคัญในการ refactor "
            "คือพฤติกรรมของโค้ดต้องไม่เปลี่ยนไป ก่อน refactor input A เข้าไป ได้ output B ออกมา "
            "หลังจากการ refactor พฤติกรรมนี้ก็ต้องไม่เปลี่ยน"
        ),
        Paragraph(
            "การเขียน testcase ก่อน refactor เพื่อ capture พฤติกรรมในปัจจุบันเอาไว้จึงมีประโยชน์มาก เพราะหลังจาก "
            "refactor เสร็จแล้ว เราสามารถที่จะนำ testcase ที่เขียนไว้มารันทดสอบอีกรอบ ว่าโค้ดที่เราแก้ไป "
            "มันยังทำงานได้เหมือนเดิมหรือไม่ ถ้าไม่เราจะได้รู้และแก้ไขได้ทัน ก่อนจะ deploy ขึ้น production นั่นเอง"
        ),
        Paragraph(
            "<i>เทคนิคนี้จึงช่วยให้เรา refactor ได้อย่างสบายใจมากยิ่งขึ้น ไม่ต้องกังวลว่าจะทำอะไรพลาดไปแล้วหลุดออกไปบน "
            "production เพราะแค่เรารัน testcase ซ้ำอีกรอบก็รู้ทันที</i>"
        ),
        Paragraph(
            "เกี่ยวกับเรื่องนี้ ผมขอแนะนำคลิปจากคุณ <b>Dave Farley</b> จากช่อง <b>Continuous Delivery</b> โดยคุณ "
            "Farley จะยกตัวอย่างโค้ด legacy จริงที่เขียนเอาไว้ไม่ดีเท่าไหร่ แล้วทำการเขียน testcase ขึ้นมา (เรียกว่า "
            "approval test) เพื่อ capture พฤติกรรมเดิมเอาไว้ จากนั้นก็จะทำการ refactor โค้ดไปเรื่อย ๆ จนพอใจ"
        ),
        Paragraph(
            "จุดที่อยากให้สังเกตุคือคุณ Farley ค่อย ๆ refactor แค่ทีละนิด ๆ เท่านั้น แล้วหลังจากการแก้ไขทุกครั้ง คุณ "
            "Farley ก็จะรัน testcase เสมอ เพื่อให้แน่ใจว่าสิ่งที่แก้ไป ไม่ได้ทำอะไรผิดพลาด"
        ),
        Paragraph(
            "จริง ๆ series นี้มีทั้งหมด 3 คลิป แต่ถ้ามีเวลาน้อย แนะนำให้ดูแค่คลิปแรก "
            "ก็น่าจะเห็นประโยชน์ของเทคนิคนี้แล้วครับ ส่วนอีก 2 "
            "คลิปหลังจะเป็นเทคนิคต่าง ๆ ในการ refactor โค้ดให้ดีขึ้น"
        ),
        Video("https://www.youtube.com/embed/p-oWHEfXEVs"),
        Video("https://www.youtube.com/embed/NCjwUptCaLU"),
        Video("https://www.youtube.com/embed/3iirETgRaRc"),
    ],
)
